In [1]:
#Alumni Assignment
# Q1 import alumni csv data
#import necessary libraries

In [5]:
import pandas as pd

import os #input/output events

alumn_data = pd.read_csv("./alumni.csv")

In [6]:
#Q1 Write code to load the alumni csv dataset into a Pandas DataFrame called 'alumni'.

alumn_data = pd.DataFrame(data = alumn_data)

In [7]:
#Use the following pandas commands to understand the data set: a) head,

alumn_data.head()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"

In [8]:
#Use the following pandas commands to understand the data set: b) tail,

In [9]:
alumn_data.tail()

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [10]:
#Use the following pandas commands to understand the data set: c) info

alumn_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Year Graduated  88 non-null     int64
 1   Gender          88 non-null     object
 2   Marital Status  88 non-null     object
 3   Diploma Type    88 non-null     object
 4   Defaulted       88 non-null     object
 5   Salary          88 non-null     int64
 6   Fee             88 non-null     int64
 7   Savings ($)     88 non-null     object
dtypes: int64(3), object(5)
memory usage: 5.6+ KB

In [12]:
alumn_data.describe()

       Year Graduated         Salary           Fee
count       88.000000      88.000000     88.000000
mean      2006.477273   84090.909091  11708.727273
std          1.560852   21234.128008   1110.647949
min       2004.000000   35000.000000  10869.000000
25%       2005.000000   75000.000000  10968.000000
50%       2006.500000   75000.000000  11696.000000
75%       2008.000000   90000.000000  12058.250000
max       2009.000000  160000.000000  20960.000000

In [14]:
alumn_data.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [82]:
def clean_currency(curr):
    
    return float (curr.replace(",","").replace("$",""))
clean_currency('$66,000')

66000.0

In [100]:
#a) (2)

#alumn_data.dropna(how = "all", inplace = True)

alumn_data.isna().sum()

Year Graduated    0
Gender            0
Marital Status    0
Diploma Type      0
Defaulted         0
Salary            0
Fee               0
Savings ($)       0
dtype: int64

In [96]:
#b) (1)

alumn_data.dtypes

Year Graduated     int64
Gender            object
Marital Status    object
Diploma Type      object
Defaulted         object
Salary             int64
Fee                int64
Savings ($)       object
dtype: object

In [101]:
alumn_data.isnull().sum()

Year Graduated    0
Gender            0
Marital Status    0
Diploma Type      0
Defaulted         0
Salary            0
Fee               0
Savings ($)       0
dtype: int64

In [104]:
alumn_data.dropna(how = "all")

#alumn_data['Savings ($)']

,Year Graduated,Gender,Marital Status,Diploma Type,Defaulted,Salary,Fee,Savings ($)
0,2004,Male,Single,Standard Diploma,Yes,125000,10869,"$86,000"
1,2005,Male,Married,College Prep Diploma,No,100000,10869,"$116,000"
2,2006,Female,Single,Standard Diploma,Yes,70000,10869,"$52,000"
3,2007,Male,Married,Standard Diploma,No,120000,10869,"$76,000"
4,2006,Female,Divorced,Standard Diploma,Yes,95000,11948,"$52,000"
...,...,...,...,...,...,...,...,...
83,2007,Male,Single,Standard Diploma,No,75000,12066,"$16,000"
84,2008,M,Single,College Prep Diploma,Yes,65000,12066,"$72,000"
85,2009,Male,Married,Standard Diploma,No,75000,12066,"$46,000"
86,2005,Female,Divorced,Standard Diploma,Yes,100000,12067,"$32,000"
87,2006,Male,Married,Standard Diploma,Yes,75000,12067,"$67,000"

In [105]:
#alumn_data['Savings ($)'] = pd.to_numeric(alumn_data['Savings ($)'])

In [106]:
alumn_data.dropna(how = "all", inplace = True)

In [107]:
alumn_data.isna().sum()

Year Graduated    0
Gender            0
Marital Status    0
Diploma Type      0
Defaulted         0
Salary            0
Fee               0
Savings ($)       0
dtype: int64

In [123]:
alumn_data['Savings ($)'] = pd.to_numeric(alumn_data['Savings ($)'])


#alumn_data['Savings ($)'] = alumn_data['Savings ($)'].astype('float')

ValueError: Unable to parse string "$86,000" at position 0

In [120]:
alumn_data['Savings']=alumn_data['Savings ($)'] #= pd.to_numeric(alumn_data['Savings ($)'])

In [121]:
#alumn_data.dtypes.Savings